[Killed] BooleanLiteral
src/main/pages/ProfilePage.js:18:38
     
 
     const { data: currentUser } = useCurrentUser();
-    const [show, setShow] = useState(false);
+    const [show, setShow] = useState(true);
     //Stryker disable all
     const [phoneNumber, setPhoneNumber] = useState("");
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Input phone number</div> instead
