[Survived] LogicalOperator
main/components/Nav/AppNavbar.js:77:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Rider" id="appnavbar-admin-dropdown" data-testid="appnavbar-rider-dropdown" >
-                    <NavDropdown.Item as={Link} to="/rider">Rider Dashboard</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Rider" id="appnavbar-admin-dropdown" data-testid="appnavbar-rider-dropdown">
+                    <NavDropdown.Item as={Link} to="/rider">Rider Dashboard</NavDropdown.Item>
+                  </NavDropdown>
               }
               {

[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:77:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Rider" id="appnavbar-admin-dropdown" data-testid="appnavbar-rider-dropdown" >
-                    <NavDropdown.Item as={Link} to="/rider">Rider Dashboard</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {
