[Killed] BlockStatement
main/components/Nav/AppNavbar.js:15:41
   );
 }
 
-function createRideRequest(currentUser) {
-  if (hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN")) {
-    return (<NavDropdown.Item data-testid="appnavbar-ride-create-dropdown" as={Link} to="/ride/create">Request Ride</NavDropdown.Item>)
-  } else {
-    return (<div data-testid="NO-appnavbar-ride-create-dropdown"></div>)
-  }
-}
+function createRideRequest(currentUser) {}
 
 export default function AppNavbar({ currentUser, systemInfo, doLogout, currentUrl = window.location.href }) {
killedBy: AppNavbar tests renders ride links correctly for admin user
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-ride-create-dropdown/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:16:7
 }
 
 function createRideRequest(currentUser) {
-  if (hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN")) {
+  if (false) {
     return (<NavDropdown.Item data-testid="appnavbar-ride-create-dropdown" as={Link} to="/ride/create">Request Ride</NavDropdown.Item>)
   } else {
killedBy: AppNavbar tests renders ride links correctly for rider
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:16:7
 }
 
 function createRideRequest(currentUser) {
-  if (hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN")) {
+  if (hasRole(currentUser, "ROLE_RIDER") && hasRole(currentUser, "ROLE_ADMIN")) {
     return (<NavDropdown.Item data-testid="appnavbar-ride-create-dropdown" as={Link} to="/ride/create">Request Ride</NavDropdown.Item>)
   } else {
killedBy: AppNavbar tests renders ride links correctly for rider
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
main/components/Nav/AppNavbar.js:18:10
 function createRideRequest(currentUser) {
   if (hasRole(currentUser, "ROLE_RIDER") || hasRole(currentUser, "ROLE_ADMIN")) {
     return (<NavDropdown.Item data-testid="appnavbar-ride-create-dropdown" as={Link} to="/ride/create">Request Ride</NavDropdown.Item>)
-  } else {
-    return (<div data-testid="NO-appnavbar-ride-create-dropdown"></div>)
-  }
+  } else {}
 }
 
killedBy: AppNavbar tests Create ride should not be available for user that is a Driver and neither Admin nor Rider
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/Nav/AppNavbar.js:26:24
 export default function AppNavbar({ currentUser, systemInfo, doLogout, currentUrl = window.location.href }) {
   const styles = {
     navbar: {
-      backgroundColor: "#003660",
+      backgroundColor: "",
     }
   }
killedBy: AppNavbar tests background of AppNavbar is UCSB's navy color
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: rgb(0, 54, 96);

<html>
  <head />

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:33:9
   return (
     <>
       {
-        (currentUrl.startsWith("http://localhost:3000") || currentUrl.startsWith("http://127.0.0.1:3000")) && (
-          <AppNavbarLocalhost url={currentUrl} />
-        )
+        true
       }
 
killedBy: AppNavbar tests renders the AppNavbarLocalhost when on http://localhost:3000
statusReason: Error: Unable to find an element by: [data-testid="AppNavbarLocalhost"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:70:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item as={Link} to="/admin/users">Users</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:77:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Rider" id="appnavbar-rider-dropdown" data-testid="appnavbar-rider-dropdown" >
-                    <NavDropdown.Item as={Link} to="/rider">Rider Dashboard</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Rider" id="appnavbar-rider-dropdown" data-testid="appnavbar-rider-dropdown">
+                    <NavDropdown.Item as={Link} to="/rider">Rider Dashboard</NavDropdown.Item>
+                  </NavDropdown>
               }
               {
killedBy: AppNavbar tests renders correctly for admin(using admin for now until rider is implemented) user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-rider-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:77:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Rider" id="appnavbar-rider-dropdown" data-testid="appnavbar-rider-dropdown" >
-                    <NavDropdown.Item as={Link} to="/rider">Rider Dashboard</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders correctly for admin(using admin for now until rider is implemented) user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-rider-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:84:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shift" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item as={Link} to="/shift/list">Driver shift table</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders shift table links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-shift-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:91:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Ride Request" id="appnavbar-ride-dropdown" data-testid="appnavbar-ride-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-ride-dropdown-rides" as={Link} to="/ride/">Rides</NavDropdown.Item>
-                    { createRideRequest(currentUser) }
-                  </NavDropdown>
-                )
+                isParticipant(currentUser) || <NavDropdown title="Ride Request" id="appnavbar-ride-dropdown" data-testid="appnavbar-ride-dropdown">
+                    <NavDropdown.Item data-testid="appnavbar-ride-dropdown-rides" as={Link} to="/ride/">Rides</NavDropdown.Item>
+                    {createRideRequest(currentUser)}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="nav-item dropdown" data-testid="appnavbar-ride-dropdown"><a aria-expanded="false" class="dropdown-toggle nav-link" href="#" id="appnavbar-ride-dropdown" role="button" tabindex="0">Ride Request</a></div> instead

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:91:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Ride Request" id="appnavbar-ride-dropdown" data-testid="appnavbar-ride-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-ride-dropdown-rides" as={Link} to="/ride/">Rides</NavDropdown.Item>
-                    { createRideRequest(currentUser) }
-                  </NavDropdown>
-                )
+                false
               }
             </Nav>
killedBy: AppNavbar tests renders ride links correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-ride-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
      style="background-color: rgb(0, 54, 96);"
