[Survived] BlockStatement
src/main/pages/PrivacyPolicy.js:3:41
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function PrivacyPolicy() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h2>Privacy Policy</h2> 
-        <p>
-            PLACEHOLDER HTML FILE WILL BE INCLUDED
-        </p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function PrivacyPolicy() {}
 
 
