[Killed] ObjectLiteral
main/components/Ride/RideTable.js:45:9
             Header: 'Student',
             accessor: 'student',
         },
-        {
-            Header: 'Driver',
-            accessor: 'driver',
-        },
+        {},
         {
             Header: 'Course #',
killedBy: RideRequestIndexPage tests renders three rides without crashing for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:47:23
         },
         {
             Header: 'Driver',
-            accessor: 'driver',
+            accessor: "",
         },
         {
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-driver"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Ride/RideTable.js:66:21
             accessor: 'pickupLocation',
         },
         {
-            Header: 'Drop Off',
+            Header: "",
             accessor: 'dropoffLocation',
         },
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Drop Off. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:115:9
     ];
 
     const columnsRider = [
-        {
-            Header: 'id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
+        {},
         {
             Header: 'Day',
killedBy: RideTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:140:21
             accessor: 'endTime',
         },
         {
-            Header: 'Pick Up',
+            Header: "",
             accessor: 'pickupLocation',
         },
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: TestingLibraryElementError: Unable to find an element with the text: Pick Up. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Ride/RideTable.js:143:9
             Header: 'Pick Up',
             accessor: 'pickupLocation',
         },
-        {
-            Header: 'Drop Off',
-            accessor: 'dropoffLocation',
-        },
+        {},
         {
             Header: 'Room #',
killedBy: RideTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Ride/RideTable.js:163:58
     const buttonColumnsAdmin = [
         ...columns,
         ButtonColumn("Edit", "primary", editCallback, "RideTable"),
-        ButtonColumn("Delete", "danger", deleteCallback, "RideTable")
+        ButtonColumn("Delete", "danger", deleteCallback, "")
     ]
 
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
