[Killed] ObjectLiteral
main/pages/Ride/RideRequestCreatePage.js:9:44
 
 export default function RideRequestCreatePage() {
 
-    const objectToAxiosParams = (ride) => ({
-        url: "/api/ride_request/post",
-        method: "POST",
-        params: {
-            day: ride.day,
-            startTime: ride.start,
-            endTime: ride.end, 
-            pickupLocation: ride.pickup,
-            dropoffLocation: ride.dropoff,
-            room: ride.room,
-            course: ride.course
-        }
-    });
+    const objectToAxiosParams = (ride) => ({});
 
     const onSuccess = (ride) => {
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Ride/RideRequestCreatePage.js:24:15
     });
 
     const onSuccess = (ride) => {
-        toast(`New Ride Created - id: ${ride.id}`);
+        toast(``);
     }
 
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Ride Created - id: 17"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/Ride/RideRequestCreatePage.js:40:20
         mutation.mutate(data);
     }
 
-    if (isSuccess) {
-        return <Navigate to="/ride/" />
-    }
+    if (isSuccess) {}
 
     return (
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ride/"}

Number of calls: 0
