[Killed] ObjectLiteral
main/pages/Ride/RideRequestEditPage.js:26:45
     );
 
 
-  const objectToAxiosPutParams = (ride) => ({
-    url: "/api/ride_request",
-    method: "PUT",
-    params: {
-      id: ride.id,
-    },
-    data: {
-        day: ride.day,
-        startTime: ride.start,
-        endTime: ride.end, 
-        pickupLocation: ride.pickup,
-        dropoffLocation: ride.dropoff,
-        room: ride.room,
-        course: ride.course
-    }
-  });
+  const objectToAxiosPutParams = (ride) => ({});
 
   const onSuccess = (ride) => {
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/pages/Ride/RideRequestEditPage.js:68:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Ride Request</h1>
-                {ride &&
-                <RideForm initialContents={ride} submitAction={onSubmit} buttonLabel="Update" />
+                {false
                 }
             </div>
killedBy: RideRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RideForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
