[Killed] BlockStatement
main/pages/RiderDashboard/RideDashboardIndexPage.js:3:48
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function PlaceholderIndexPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function PlaceholderIndexPage() {}
killedBy: RideDashboardIndexPage tests Renders expected content
statusReason: Error: PlaceholderIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
