[Survived] BlockStatement
main/pages/RiderDashboard/RideDashboardIndexPage.js:10:48
 //import Button from 'react-bootstrap/Button';
 //import { Link } from 'react-router-dom';
 
-export default function RideRequestIndexPage() {
-
-  const currentUser = useCurrentUser();
-
-  const { data: rides, error: _error, status: _status } =
-  useBackend(
-    // Stryker disable all : hard to test for query caching
-    ["/api/ride_request/all"],
-    { method: "GET", url: "/api/ride_request/all" },
-    []
-    // Stryker restore all 
-  );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Ride Requests</h1>
-        <RideTable ride={rides} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RideRequestIndexPage() {}
