[Killed] StringLiteral
main/components/Shift/ShiftTable.js:12:20
 export default function ShiftTable({
     shift,
     currentUser,
-    testIdPrefix = "ShiftTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: ShiftIndexPage tests fetches shifts using the correct GET method
statusReason: Error: Unable to find an element by: [data-testid="ShiftTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/components/Shift/ShiftTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/shift/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: ShiftTable tests Edit button triggers navigation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/shift/edit/1"

Number of calls: 0

[Killed] StringLiteral
main/components/Shift/ShiftTable.js:17:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/shift/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: ShiftTable tests Edit button triggers navigation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/shift/edit/1"
Received: ""

Number of calls: 1

[Killed] StringLiteral
main/components/Shift/ShiftTable.js:43:23
         },
         {
             Header: 'Shift start',
-            accessor: 'shiftStart',
+            accessor: "",
         },
         {
killedBy: ShiftTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftTable-cell-row-0-col-shiftStart"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Shift/ShiftTable.js:45:9
             Header: 'Shift start',
             accessor: 'shiftStart',
         },
-        {
-            Header: 'Shift end',
-            accessor: 'shiftEnd',
-        },
+        {},
         {
             Header: 'Driver',
killedBy: ShiftIndexPage tests fetches shifts using the correct GET method
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Shift/ShiftTable.js:51:23
         },
         {
             Header: 'Driver',
-            accessor: 'driverID'
+            accessor: ""
         },
         {
killedBy: ShiftTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftTable-cell-row-0-col-driverID"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Shift/ShiftTable.js:53:9
             Header: 'Driver',
             accessor: 'driverID'
         },
-        {
-            Header: 'Backup driver',
-            accessor: 'driverBackupID',
-        }
+        {}
     ];
 
killedBy: ShiftTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!
