[Killed] BooleanLiteral
main/pages/Shift/ShiftCreatePage.js:7:52
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function ShiftCreatePage({storybook=false}) {
+export default function ShiftCreatePage({storybook=true}) {
 
     const objectToAxiosParams = (shift) => ({
killedBy: ShiftCreatePage tests on submit, makes request to backend, and redirects to /shift
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/shift"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/Shift/ShiftCreatePage.js:9:33
 
 export default function ShiftCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (shift) => ({
-        url: "/api/shift/post",
-        method: "POST",
-        params: {
-            day: shift.day,
-            driverBackupID: shift.driverBackupID,
-            driverID: shift.driverID,
-            id: shift.id,
-            shiftEnd: shift.shiftEnd,
-            shiftStart: shift.shiftStart,
-        }
-    });
+    const objectToAxiosParams = () => undefined;
     
 
killedBy: ShiftCreatePage tests on submit, makes request to backend, and redirects to /shift
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Shift/ShiftCreatePage.js:9:45
 
 export default function ShiftCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (shift) => ({
-        url: "/api/shift/post",
-        method: "POST",
-        params: {
-            day: shift.day,
-            driverBackupID: shift.driverBackupID,
-            driverID: shift.driverID,
-            id: shift.id,
-            shiftEnd: shift.shiftEnd,
-            shiftStart: shift.shiftStart,
-        }
-    });
+    const objectToAxiosParams = (shift) => ({});
     
 
killedBy: ShiftCreatePage tests on submit, makes request to backend, and redirects to /shift
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Shift/ShiftCreatePage.js:41:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/shift" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: ShiftCreatePage tests on submit, makes request to backend, and redirects to /shift
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/shift"}

Number of calls: 0
