[Killed] BooleanLiteral
main/pages/Shift/ShiftEditPage.js:8:52
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function ShiftEditPage({storybook = false}) {
+export default function ShiftEditPage({storybook = true}) {
     let { id } = useParams();
 
killedBy: ShiftEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/shift"}

Number of calls: 0

[Killed] StringLiteral
main/pages/Shift/ShiftEditPage.js:17:22
             [`/api/shift?id=${id}`],
             {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
                 method: "GET",
-                url: `/api/shift`,
+                url: ``,
                 params: {
                     id
killedBy: ShiftEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="ShiftForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Shift/ShiftEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (myshift) => ({
-        url: "/api/shift",
-        method: "PUT",
-        params: {
-            id: myshift.id,
-        },
-        data: {
-            day: myshift.day,
-            shiftStart: myshift.shiftStart,
-            shiftEnd: myshift.shiftEnd, 
-            driverID: myshift.driverID,
-            driverBackupID: myshift.driverBackupID
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (myshift) => {
killedBy: ShiftEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Shift/ShiftEditPage.js:39:36
         }
     });
 
-    const onSuccess = (myshift) => {
-        toast(`Shift Updated - id: ${myshift.id}`);
-    }
+    const onSuccess = (myshift) => {}
 
     const mutation = useBackendMutation(
killedBy: ShiftEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/pages/Shift/ShiftEditPage.js:64:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Shift</h1>
-                {myshift &&
-                <ShiftForm initialContents={myshift} submitAction={onSubmit} buttonLabel="Update" />
+                {myshift || <ShiftForm initialContents={myshift} submitAction={onSubmit} buttonLabel="Update" />
                 }
             </div>
killedBy: ShiftEditPage tests when the backend doesn't return a shift renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] ConditionalExpression
main/pages/Shift/ShiftEditPage.js:64:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Shift</h1>
-                {myshift &&
-                <ShiftForm initialContents={myshift} submitAction={onSubmit} buttonLabel="Update" />
+                {false
                 }
             </div>
killedBy: ShiftEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="ShiftForm-day"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
