[Killed] StringLiteral
main/components/Ride/RideTable.js:71:23
         },
         {
             Header: 'Room #',
-            accessor: 'dropoffRoom',
+            accessor: "",
         }
     ];
killedBy: RideTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RideTable-cell-row-0-col-dropoffRoom"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
