[Killed] ArrowFunction
main/pages/Ride/RideRequestCreatePage.js:9:33
 
 export default function RideRequestCreatePage() {
 
-    const objectToAxiosParams = (ride) => ({
-        url: "/api/ride_request/post",
-        method: "POST",
-        params: {
-            day: ride.day,
-            startTime: ride.start,
-            endTime: ride.end, 
-            pickupLocation: ride.pickup,
-            dropoffLocation: ride.dropoff,
-            dropoffRoom: ride.dropoffRoom,
-            course: ride.course
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (ride) => {
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Ride/RideRequestCreatePage.js:9:44
 
 export default function RideRequestCreatePage() {
 
-    const objectToAxiosParams = (ride) => ({
-        url: "/api/ride_request/post",
-        method: "POST",
-        params: {
-            day: ride.day,
-            startTime: ride.start,
-            endTime: ride.end, 
-            pickupLocation: ride.pickup,
-            dropoffLocation: ride.dropoff,
-            dropoffRoom: ride.dropoffRoom,
-            course: ride.course
-        }
-    });
+    const objectToAxiosParams = (ride) => ({});
 
     const onSuccess = (ride) => {
killedBy: RideRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
