[Killed] ArrowFunction
main/pages/Ride/RideRequestEditPage.js:26:34
     );
 
 
-  const objectToAxiosPutParams = (ride) => ({
-    url: "/api/ride_request",
-    method: "PUT",
-    params: {
-      id: ride.id,
-    },
-    data: {
-        day: ride.day,
-        startTime: ride.start,
-        endTime: ride.end, 
-        pickupLocation: ride.pickup,
-        dropoffLocation: ride.dropoff,
-        dropoffRoom: ride.dropoffRoom,
-        course: ride.course
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ride) => {
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Ride/RideRequestEditPage.js:26:45
     );
 
 
-  const objectToAxiosPutParams = (ride) => ({
-    url: "/api/ride_request",
-    method: "PUT",
-    params: {
-      id: ride.id,
-    },
-    data: {
-        day: ride.day,
-        startTime: ride.start,
-        endTime: ride.end, 
-        pickupLocation: ride.pickup,
-        dropoffLocation: ride.dropoff,
-        dropoffRoom: ride.dropoffRoom,
-        course: ride.course
-    }
-  });
+  const objectToAxiosPutParams = (ride) => ({});
 
   const onSuccess = (ride) => {
killedBy: RideRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
